FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1768/CodeRed2/include/LPC1756.h
#define I2C2ADR3 (*(volatile unsigned char *)0x400A0028)
#define I2C2ADR3_OFFSET 0x28
#define I2C2ADR3_GC_MASK 0x1
#define I2C2ADR3_GC 0x1
#define I2C2ADR3_GC_BIT 0
#define I2C2ADR3_Address_MASK 0xFE
#define I2C2ADR3_Address_BIT 1

#define I2C2DATA_BUFFER (*(volatile unsigned char *)0x400A002C)
#define I2C2DATA_BUFFER_OFFSET 0x2C

#define I2C2MASK0 (*(volatile unsigned long *)0x400A0030)
#define I2C2MASK0_OFFSET 0x30
#define I2C2MASK0_MASK_MASK 0xFE
#define I2C2MASK0_MASK_BIT 1

#define I2C2MASK1 (*(volatile unsigned long *)0x400A0034)
#define I2C2MASK1_OFFSET 0x34
#define I2C2MASK1_MASK_MASK 0xFE
#define I2C2MASK1_MASK_BIT 1

#define I2C2MASK2 (*(volatile unsigned long *)0x400A0038)
#define I2C2MASK2_OFFSET 0x38
#define I2C2MASK2_MASK_MASK 0xFE
#define I2C2MASK2_MASK_BIT 1

#define I2C2MASK3 (*(volatile unsigned long *)0x400A003C)
#define I2C2MASK3_OFFSET 0x3C
#define I2C2MASK3_MASK_MASK 0xFE
#define I2C2MASK3_MASK_BIT 1

#define I2S_BASE_ADDRESS 0x400A8000

#define I2SDAO (*(volatile unsigned long *)0x400A8000)
#define I2SDAO_OFFSET 0x0
#define I2SDAO_wordwidth_MASK 0x3
#define I2SDAO_wordwidth_BIT 0
#define I2SDAO_mono_MASK 0x4
#define I2SDAO_mono 0x4
#define I2SDAO_mono_BIT 2
#define I2SDAO_stop_MASK 0x8
#define I2SDAO_stop 0x8
#define I2SDAO_stop_BIT 3
#define I2SDAO_reset_MASK 0x10
#define I2SDAO_reset 0x10
#define I2SDAO_reset_BIT 4
#define I2SDAO_ws_sel_MASK 0x20
#define I2SDAO_ws_sel 0x20
#define I2SDAO_ws_sel_BIT 5
#define I2SDAO_ws_halfperiod_MASK 0x7FC0
#define I2SDAO_ws_halfperiod_BIT 6
#define I2SDAO_mute_MASK 0x8000
#define I2SDAO_mute 0x8000
#define I2SDAO_mute_BIT 15

#define I2SDAI (*(volatile unsigned long *)0x400A8004)
#define I2SDAI_OFFSET 0x4
#define I2SDAI_wordwidth_MASK 0x3
#define I2SDAI_wordwidth_BIT 0
#define I2SDAI_mono_MASK 0x4
#define I2SDAI_mono 0x4
#define I2SDAI_mono_BIT 2
#define I2SDAI_stop_MASK 0x8
#define I2SDAI_stop 0x8
#define I2SDAI_stop_BIT 3
#define I2SDAI_reset_MASK 0x10
#define I2SDAI_reset 0x10
#define I2SDAI_reset_BIT 4
#define I2SDAI_ws_sel_MASK 0x20
#define I2SDAI_ws_sel 0x20
#define I2SDAI_ws_sel_BIT 5
#define I2SDAI_ws_halfperiod_MASK 0x7FC0
#define I2SDAI_ws_halfperiod_BIT 6

#define I2STXFIFO (*(volatile unsigned long *)0x400A8008)
#define I2STXFIFO_OFFSET 0x8

#define I2SRXFIFO (*(volatile unsigned long *)0x400A800C)
#define I2SRXFIFO_OFFSET 0xC

#define I2SSTATE (*(volatile unsigned long *)0x400A8010)
#define I2SSTATE_OFFSET 0x10
#define I2SSTATE_irq_MASK 0x1
#define I2SSTATE_irq 0x1
#define I2SSTATE_irq_BIT 0
#define I2SSTATE_dmareq1_MASK 0x2
#define I2SSTATE_dmareq1 0x2
#define I2SSTATE_dmareq1_BIT 1
#define I2SSTATE_dmareq2_MASK 0x4
#define I2SSTATE_dmareq2 0x4
#define I2SSTATE_dmareq2_BIT 2
#define I2SSTATE_rx_level_MASK 0x1F00
#define I2SSTATE_rx_level_BIT 8
#define I2SSTATE_tx_level_MASK 0x1F0000
#define I2SSTATE_tx_level_BIT 16

#define I2SDMA1 (*(volatile unsigned long *)0x400A8014)
#define I2SDMA1_OFFSET 0x14
#define I2SDMA1_rx_dma1_enable_MASK 0x1
#define I2SDMA1_rx_dma1_enable 0x1
#define I2SDMA1_rx_dma1_enable_BIT 0
#define I2SDMA1_tx_dma1_enable_MASK 0x2
#define I2SDMA1_tx_dma1_enable 0x2
#define I2SDMA1_tx_dma1_enable_BIT 1
#define I2SDMA1_rx_depth_dma1_MASK 0x1F00
#define I2SDMA1_rx_depth_dma1_BIT 8
#define I2SDMA1_tx_depth_dma1_MASK 0x1F0000
#define I2SDMA1_tx_depth_dma1_BIT 16

#define I2SDMA2 (*(volatile unsigned long *)0x400A8018)
#define I2SDMA2_OFFSET 0x18
#define I2SDMA2_rx_dma2_enable_MASK 0x1
#define I2SDMA2_rx_dma2_enable 0x1
#define I2SDMA2_rx_dma2_enable_BIT 0
#define I2SDMA2_tx_dma2_enable_MASK 0x2
#define I2SDMA2_tx_dma2_enable 0x2
#define I2SDMA2_tx_dma2_enable_BIT 1
#define I2SDMA2_rx_depth_dma2_MASK 0x1F00
#define I2SDMA2_rx_depth_dma2_BIT 8
#define I2SDMA2_tx_depth_dma2_MASK 0x1F0000
#define I2SDMA2_tx_depth_dma2_BIT 16

#define I2SIRQ (*(volatile unsigned long *)0x400A801C)
#define I2SIRQ_OFFSET 0x1C
#define I2SIRQ_rx_irq_enable_MASK 0x1
#define I2SIRQ_rx_irq_enable 0x1
#define I2SIRQ_rx_irq_enable_BIT 0
#define I2SIRQ_tx_irq_enable_MASK 0x2
#define I2SIRQ_tx_irq_enable 0x2
#define I2SIRQ_tx_irq_enable_BIT 1
#define I2SIRQ_rx_depth_irq_MASK 0x1F00
#define I2SIRQ_rx_depth_irq_BIT 8
#define I2SIRQ_tx_depth_irq_MASK 0xFF0000
#define I2SIRQ_tx_depth_irq_BIT 16

#define I2STXRATE (*(volatile unsigned long *)0x400A8020)
#define I2STXRATE_OFFSET 0x20
#define I2STXRATE_Y_divider_MASK 0xFF
#define I2STXRATE_Y_divider_BIT 0
#define I2STXRATE_X_divider_MASK 0xFF00
#define I2STXRATE_X_divider_BIT 8

#define I2SRXRATE (*(volatile unsigned long *)0x400A8024)
#define I2SRXRATE_OFFSET 0x24
#define I2SRXRATE_Y_divider_MASK 0xFF
#define I2SRXRATE_Y_divider_BIT 0
#define I2SRXRATE_X_divider_MASK 0xFF00
#define I2SRXRATE_X_divider_BIT 8

#define I2STXBITRATE (*(volatile unsigned long *)0x400A8028)
#define I2STXBITRATE_OFFSET 0x28
#define I2STXBITRATE_tx_bitrate_MASK 0x3F
#define I2STXBITRATE_tx_bitrate_BIT 0

#define I2SRXBITRATE (*(volatile unsigned long *)0x400A802C)
#define I2SRXBITRATE_OFFSET 0x2C
#define I2SRXBITRATE_rx_bitrate_MASK 0x3F
#define I2SRXBITRATE_rx_bitrate_BIT 0

#define I2STXMODE (*(volatile unsigned long *)0x400A8030)
#define I2STXMODE_OFFSET 0x30
#define I2STXMODE_TXCLKSEL_MASK 0x3
#define I2STXMODE_TXCLKSEL_BIT 0
#define I2STXMODE_TX4PIN_MASK 0x4
#define I2STXMODE_TX4PIN 0x4
#define I2STXMODE_TX4PIN_BIT 2
#define I2STXMODE_TXMCENA_MASK 0x8
#define I2STXMODE_TXMCENA 0x8
#define I2STXMODE_TXMCENA_BIT 3

#define I2SRXMODE (*(volatile unsigned long *)0x400A8034)
#define I2SRXMODE_OFFSET 0x34
#define I2SRXMODE_RXCLKSEL_MASK 0x3
#define I2SRXMODE_RXCLKSEL_BIT 0
#define I2SRXMODE_RX4PIN_MASK 0x4
#define I2SRXMODE_RX4PIN 0x4
#define I2SRXMODE_RX4PIN_BIT 2
#define I2SRXMODE_RXMCENA_MASK 0x8
#define I2SRXMODE_RXMCENA 0x8
#define I2SRXMODE_RXMCENA_BIT 3

#define RIT_BASE_ADDRESS 0x400B0000

#define RICOMPVAL (*(volatile unsigned long *)0x400B0000)
#define RICOMPVAL_OFFSET 0x0

