FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1768/CodeRed2/include/LPC1756.h
#define MCLIM2 (*(volatile unsigned long *)0x400B802C)
#define MCLIM2_OFFSET 0x2C

#define MCMAT0 (*(volatile unsigned long *)0x400B8030)
#define MCMAT0_OFFSET 0x30

#define MCMAT1 (*(volatile unsigned long *)0x400B8034)
#define MCMAT1_OFFSET 0x34

#define MCMAT2 (*(volatile unsigned long *)0x400B8038)
#define MCMAT2_OFFSET 0x38

#define MCDT (*(volatile unsigned long *)0x400B803C)
#define MCDT_OFFSET 0x3C
#define MCDT_DT0_MASK 0x3FF
#define MCDT_DT0_BIT 0
#define MCDT_DT1_MASK 0xFFC00
#define MCDT_DT1_BIT 10
#define MCDT_DT2_MASK 0x3FF00000
#define MCDT_DT2_BIT 20

#define MCCP (*(volatile unsigned long *)0x400B8040)
#define MCCP_OFFSET 0x40
#define MCCP_CCPA0_MASK 0x1
#define MCCP_CCPA0 0x1
#define MCCP_CCPA0_BIT 0
#define MCCP_CCPB0_MASK 0x2
#define MCCP_CCPB0 0x2
#define MCCP_CCPB0_BIT 1
#define MCCP_CCPA1_MASK 0x4
#define MCCP_CCPA1 0x4
#define MCCP_CCPA1_BIT 2
#define MCCP_CCPB1_MASK 0x8
#define MCCP_CCPB1 0x8
#define MCCP_CCPB1_BIT 3
#define MCCP_CCPA2_MASK 0x10
#define MCCP_CCPA2 0x10
#define MCCP_CCPA2_BIT 4
#define MCCP_CCPB2_MASK 0x20
#define MCCP_CCPB2 0x20
#define MCCP_CCPB2_BIT 5

#define MCCAP0 (*(volatile unsigned long *)0x400B8044)
#define MCCAP0_OFFSET 0x44

#define MCCAP1 (*(volatile unsigned long *)0x400B8048)
#define MCCAP1_OFFSET 0x48

#define MCCAP2 (*(volatile unsigned long *)0x400B804C)
#define MCCAP2_OFFSET 0x4C

#define MCINTEN (*(volatile unsigned long *)0x400B8050)
#define MCINTEN_OFFSET 0x50
#define MCINTEN_ILIM0_MASK 0x1
#define MCINTEN_ILIM0 0x1
#define MCINTEN_ILIM0_BIT 0
#define MCINTEN_IMAT0_MASK 0x2
#define MCINTEN_IMAT0 0x2
#define MCINTEN_IMAT0_BIT 1
#define MCINTEN_ICAP0_MASK 0x4
#define MCINTEN_ICAP0 0x4
#define MCINTEN_ICAP0_BIT 2
#define MCINTEN_ILIM1_MASK 0x10
#define MCINTEN_ILIM1 0x10
#define MCINTEN_ILIM1_BIT 4
#define MCINTEN_IMAT1_MASK 0x20
#define MCINTEN_IMAT1 0x20
#define MCINTEN_IMAT1_BIT 5
#define MCINTEN_ICAP1_MASK 0x40
#define MCINTEN_ICAP1 0x40
#define MCINTEN_ICAP1_BIT 6
#define MCINTEN_ILIM2_MASK 0x100
#define MCINTEN_ILIM2 0x100
#define MCINTEN_ILIM2_BIT 8
#define MCINTEN_IMAT2_MASK 0x200
#define MCINTEN_IMAT2 0x200
#define MCINTEN_IMAT2_BIT 9
#define MCINTEN_ICAP2_MASK 0x400
#define MCINTEN_ICAP2 0x400
#define MCINTEN_ICAP2_BIT 10
#define MCINTEN_ABORT_MASK 0x8000
#define MCINTEN_ABORT 0x8000
#define MCINTEN_ABORT_BIT 15

#define MCINTEN_SET (*(volatile unsigned long *)0x400B8054)
#define MCINTEN_SET_OFFSET 0x54
#define MCINTEN_SET_ILIM0_MASK 0x1
#define MCINTEN_SET_ILIM0 0x1
#define MCINTEN_SET_ILIM0_BIT 0
#define MCINTEN_SET_IMAT0_MASK 0x2
#define MCINTEN_SET_IMAT0 0x2
#define MCINTEN_SET_IMAT0_BIT 1
#define MCINTEN_SET_ICAP0_MASK 0x4
#define MCINTEN_SET_ICAP0 0x4
#define MCINTEN_SET_ICAP0_BIT 2
#define MCINTEN_SET_ILIM1_MASK 0x10
#define MCINTEN_SET_ILIM1 0x10
#define MCINTEN_SET_ILIM1_BIT 4
#define MCINTEN_SET_IMAT1_MASK 0x20
#define MCINTEN_SET_IMAT1 0x20
#define MCINTEN_SET_IMAT1_BIT 5
#define MCINTEN_SET_ICAP1_MASK 0x40
#define MCINTEN_SET_ICAP1 0x40
#define MCINTEN_SET_ICAP1_BIT 6
#define MCINTEN_SET_ILIM2_MASK 0x100
#define MCINTEN_SET_ILIM2 0x100
#define MCINTEN_SET_ILIM2_BIT 8
#define MCINTEN_SET_IMAT2_MASK 0x200
#define MCINTEN_SET_IMAT2 0x200
#define MCINTEN_SET_IMAT2_BIT 9
#define MCINTEN_SET_ICAP2_MASK 0x400
#define MCINTEN_SET_ICAP2 0x400
#define MCINTEN_SET_ICAP2_BIT 10
#define MCINTEN_SET_ABORT_MASK 0x8000
#define MCINTEN_SET_ABORT 0x8000
#define MCINTEN_SET_ABORT_BIT 15

#define MCINTEN_CLR (*(volatile unsigned long *)0x400B8058)
#define MCINTEN_CLR_OFFSET 0x58
#define MCINTEN_CLR_ILIM0_MASK 0x1
#define MCINTEN_CLR_ILIM0 0x1
#define MCINTEN_CLR_ILIM0_BIT 0
#define MCINTEN_CLR_IMAT0_MASK 0x2
#define MCINTEN_CLR_IMAT0 0x2
#define MCINTEN_CLR_IMAT0_BIT 1
#define MCINTEN_CLR_ICAP0_MASK 0x4
#define MCINTEN_CLR_ICAP0 0x4
#define MCINTEN_CLR_ICAP0_BIT 2
#define MCINTEN_CLR_ILIM1_MASK 0x10
#define MCINTEN_CLR_ILIM1 0x10
#define MCINTEN_CLR_ILIM1_BIT 4
#define MCINTEN_CLR_IMAT1_MASK 0x20
#define MCINTEN_CLR_IMAT1 0x20
#define MCINTEN_CLR_IMAT1_BIT 5
#define MCINTEN_CLR_ICAP1_MASK 0x40
#define MCINTEN_CLR_ICAP1 0x40
#define MCINTEN_CLR_ICAP1_BIT 6
#define MCINTEN_CLR_ILIM2_MASK 0x100
#define MCINTEN_CLR_ILIM2 0x100
#define MCINTEN_CLR_ILIM2_BIT 8
#define MCINTEN_CLR_IMAT2_MASK 0x200
#define MCINTEN_CLR_IMAT2 0x200
#define MCINTEN_CLR_IMAT2_BIT 9
#define MCINTEN_CLR_ICAP2_MASK 0x400
#define MCINTEN_CLR_ICAP2 0x400
#define MCINTEN_CLR_ICAP2_BIT 10
#define MCINTEN_CLR_ABORT_MASK 0x8000
#define MCINTEN_CLR_ABORT 0x8000
#define MCINTEN_CLR_ABORT_BIT 15

#define MCCNTCON (*(volatile unsigned long *)0x400B805C)
#define MCCNTCON_OFFSET 0x5C
#define MCCNTCON_TC0MCI0_RE_MASK 0x1
#define MCCNTCON_TC0MCI0_RE 0x1
#define MCCNTCON_TC0MCI0_RE_BIT 0
#define MCCNTCON_TC0MCI0_FE_MASK 0x2
#define MCCNTCON_TC0MCI0_FE 0x2
#define MCCNTCON_TC0MCI0_FE_BIT 1
#define MCCNTCON_TC0MCI1_RE_MASK 0x4
#define MCCNTCON_TC0MCI1_RE 0x4
#define MCCNTCON_TC0MCI1_RE_BIT 2
#define MCCNTCON_TC0MCI1_FE_MASK 0x8
#define MCCNTCON_TC0MCI1_FE 0x8
#define MCCNTCON_TC0MCI1_FE_BIT 3
#define MCCNTCON_TC0MCI2_RE_MASK 0x10
#define MCCNTCON_TC0MCI2_RE 0x10
#define MCCNTCON_TC0MCI2_RE_BIT 4
#define MCCNTCON_TC0MCI2_FE_MASK 0x20
#define MCCNTCON_TC0MCI2_FE 0x20
#define MCCNTCON_TC0MCI2_FE_BIT 5
#define MCCNTCON_TC1MCI0_RE_MASK 0x40
#define MCCNTCON_TC1MCI0_RE 0x40
#define MCCNTCON_TC1MCI0_RE_BIT 6
#define MCCNTCON_TC1MCI0_FE_MASK 0x80
#define MCCNTCON_TC1MCI0_FE 0x80
#define MCCNTCON_TC1MCI0_FE_BIT 7
#define MCCNTCON_TC1MCI1_RE_MASK 0x100
#define MCCNTCON_TC1MCI1_RE 0x100
#define MCCNTCON_TC1MCI1_RE_BIT 8
#define MCCNTCON_TC1MCI1_FE_MASK 0x200
#define MCCNTCON_TC1MCI1_FE 0x200
#define MCCNTCON_TC1MCI1_FE_BIT 9
#define MCCNTCON_TC1MCI2_RE_MASK 0x400
#define MCCNTCON_TC1MCI2_RE 0x400
#define MCCNTCON_TC1MCI2_RE_BIT 10
#define MCCNTCON_TC1MCI2_FE_MASK 0x800
#define MCCNTCON_TC1MCI2_FE 0x800
#define MCCNTCON_TC1MCI2_FE_BIT 11
#define MCCNTCON_TC2MCI0_RE_MASK 0x1000
#define MCCNTCON_TC2MCI0_RE 0x1000
#define MCCNTCON_TC2MCI0_RE_BIT 12
#define MCCNTCON_TC2MCI0_FE_MASK 0x2000
#define MCCNTCON_TC2MCI0_FE 0x2000
#define MCCNTCON_TC2MCI0_FE_BIT 13
#define MCCNTCON_TC2MCI1_RE_MASK 0x4000
#define MCCNTCON_TC2MCI1_RE 0x4000
#define MCCNTCON_TC2MCI1_RE_BIT 14
#define MCCNTCON_TC2MCI1_FE_MASK 0x8000
#define MCCNTCON_TC2MCI1_FE 0x8000
#define MCCNTCON_TC2MCI1_FE_BIT 15
#define MCCNTCON_TC2MCI2_RE_MASK 0x10000
#define MCCNTCON_TC2MCI2_RE 0x10000
#define MCCNTCON_TC2MCI2_RE_BIT 16
#define MCCNTCON_TC2MCI2_FE_MASK 0x20000
#define MCCNTCON_TC2MCI2_FE 0x20000
#define MCCNTCON_TC2MCI2_FE_BIT 17
#define MCCNTCON_CNTR0_MASK 0x20000000
#define MCCNTCON_CNTR0 0x20000000
#define MCCNTCON_CNTR0_BIT 29
#define MCCNTCON_CNTR1_MASK 0x40000000
#define MCCNTCON_CNTR1 0x40000000
#define MCCNTCON_CNTR1_BIT 30
#define MCCNTCON_CNTR2_MASK 0x80000000
#define MCCNTCON_CNTR2 0x80000000
#define MCCNTCON_CNTR2_BIT 31

#define MCCNTCON_SET (*(volatile unsigned long *)0x400B8060)
#define MCCNTCON_SET_OFFSET 0x60
#define MCCNTCON_SET_TC0MCI0_RE_MASK 0x1
#define MCCNTCON_SET_TC0MCI0_RE 0x1
#define MCCNTCON_SET_TC0MCI0_RE_BIT 0
#define MCCNTCON_SET_TC0MCI0_FE_MASK 0x2
#define MCCNTCON_SET_TC0MCI0_FE 0x2
#define MCCNTCON_SET_TC0MCI0_FE_BIT 1
#define MCCNTCON_SET_TC0MCI1_RE_MASK 0x4
#define MCCNTCON_SET_TC0MCI1_RE 0x4
#define MCCNTCON_SET_TC0MCI1_RE_BIT 2
#define MCCNTCON_SET_TC0MCI1_FE_MASK 0x8
#define MCCNTCON_SET_TC0MCI1_FE 0x8
#define MCCNTCON_SET_TC0MCI1_FE_BIT 3
#define MCCNTCON_SET_TC0MCI2_RE_MASK 0x10
#define MCCNTCON_SET_TC0MCI2_RE 0x10
#define MCCNTCON_SET_TC0MCI2_RE_BIT 4
#define MCCNTCON_SET_TC0MCI2_FE_MASK 0x20
#define MCCNTCON_SET_TC0MCI2_FE 0x20
#define MCCNTCON_SET_TC0MCI2_FE_BIT 5
#define MCCNTCON_SET_TC1MCI0_RE_MASK 0x40
#define MCCNTCON_SET_TC1MCI0_RE 0x40
#define MCCNTCON_SET_TC1MCI0_RE_BIT 6
#define MCCNTCON_SET_TC1MCI0_FE_MASK 0x80
#define MCCNTCON_SET_TC1MCI0_FE 0x80
#define MCCNTCON_SET_TC1MCI0_FE_BIT 7
#define MCCNTCON_SET_TC1MCI1_RE_MASK 0x100
#define MCCNTCON_SET_TC1MCI1_RE 0x100
#define MCCNTCON_SET_TC1MCI1_RE_BIT 8
#define MCCNTCON_SET_TC1MCI1_FE_MASK 0x200
#define MCCNTCON_SET_TC1MCI1_FE 0x200
#define MCCNTCON_SET_TC1MCI1_FE_BIT 9
#define MCCNTCON_SET_TC1MCI2_RE_MASK 0x400
#define MCCNTCON_SET_TC1MCI2_RE 0x400
#define MCCNTCON_SET_TC1MCI2_RE_BIT 10
#define MCCNTCON_SET_TC1MCI2_FE_MASK 0x800
#define MCCNTCON_SET_TC1MCI2_FE 0x800
#define MCCNTCON_SET_TC1MCI2_FE_BIT 11
#define MCCNTCON_SET_TC2MCI0_RE_MASK 0x1000
#define MCCNTCON_SET_TC2MCI0_RE 0x1000
#define MCCNTCON_SET_TC2MCI0_RE_BIT 12
#define MCCNTCON_SET_TC2MCI0_FE_MASK 0x2000
#define MCCNTCON_SET_TC2MCI0_FE 0x2000
#define MCCNTCON_SET_TC2MCI0_FE_BIT 13
#define MCCNTCON_SET_TC2MCI1_RE_MASK 0x4000
#define MCCNTCON_SET_TC2MCI1_RE 0x4000
#define MCCNTCON_SET_TC2MCI1_RE_BIT 14
#define MCCNTCON_SET_TC2MCI1_FE_MASK 0x8000
#define MCCNTCON_SET_TC2MCI1_FE 0x8000
#define MCCNTCON_SET_TC2MCI1_FE_BIT 15
#define MCCNTCON_SET_TC2MCI2_RE_MASK 0x10000
#define MCCNTCON_SET_TC2MCI2_RE 0x10000
#define MCCNTCON_SET_TC2MCI2_RE_BIT 16
#define MCCNTCON_SET_TC2MCI2_FE_MASK 0x20000
#define MCCNTCON_SET_TC2MCI2_FE 0x20000
#define MCCNTCON_SET_TC2MCI2_FE_BIT 17
#define MCCNTCON_SET_CNTR0_MASK 0x20000000
#define MCCNTCON_SET_CNTR0 0x20000000
#define MCCNTCON_SET_CNTR0_BIT 29
#define MCCNTCON_SET_CNTR1_MASK 0x40000000
#define MCCNTCON_SET_CNTR1 0x40000000
#define MCCNTCON_SET_CNTR1_BIT 30
#define MCCNTCON_SET_CNTR2_MASK 0x80000000
#define MCCNTCON_SET_CNTR2 0x80000000
#define MCCNTCON_SET_CNTR2_BIT 31

#define MCCNTCON_CLR (*(volatile unsigned long *)0x400B8064)
#define MCCNTCON_CLR_OFFSET 0x64
#define MCCNTCON_CLR_TC0MCI0_RE_MASK 0x1
#define MCCNTCON_CLR_TC0MCI0_RE 0x1
#define MCCNTCON_CLR_TC0MCI0_RE_BIT 0
#define MCCNTCON_CLR_TC0MCI0_FE_MASK 0x2
#define MCCNTCON_CLR_TC0MCI0_FE 0x2
#define MCCNTCON_CLR_TC0MCI0_FE_BIT 1
#define MCCNTCON_CLR_TC0MCI1_RE_MASK 0x4
#define MCCNTCON_CLR_TC0MCI1_RE 0x4
#define MCCNTCON_CLR_TC0MCI1_RE_BIT 2
#define MCCNTCON_CLR_TC0MCI1_FE_MASK 0x8
#define MCCNTCON_CLR_TC0MCI1_FE 0x8
#define MCCNTCON_CLR_TC0MCI1_FE_BIT 3
#define MCCNTCON_CLR_TC0MCI2_RE_MASK 0x10
#define MCCNTCON_CLR_TC0MCI2_RE 0x10
#define MCCNTCON_CLR_TC0MCI2_RE_BIT 4
#define MCCNTCON_CLR_TC0MCI2_FE_MASK 0x20
#define MCCNTCON_CLR_TC0MCI2_FE 0x20
#define MCCNTCON_CLR_TC0MCI2_FE_BIT 5
#define MCCNTCON_CLR_TC1MCI0_RE_MASK 0x40
#define MCCNTCON_CLR_TC1MCI0_RE 0x40
#define MCCNTCON_CLR_TC1MCI0_RE_BIT 6
#define MCCNTCON_CLR_TC1MCI0_FE_MASK 0x80
#define MCCNTCON_CLR_TC1MCI0_FE 0x80
#define MCCNTCON_CLR_TC1MCI0_FE_BIT 7
#define MCCNTCON_CLR_TC1MCI1_RE_MASK 0x100
#define MCCNTCON_CLR_TC1MCI1_RE 0x100
#define MCCNTCON_CLR_TC1MCI1_RE_BIT 8
#define MCCNTCON_CLR_TC1MCI1_FE_MASK 0x200
#define MCCNTCON_CLR_TC1MCI1_FE 0x200
#define MCCNTCON_CLR_TC1MCI1_FE_BIT 9
#define MCCNTCON_CLR_TC1MCI2_RE_MASK 0x400
#define MCCNTCON_CLR_TC1MCI2_RE 0x400
#define MCCNTCON_CLR_TC1MCI2_RE_BIT 10
#define MCCNTCON_CLR_TC1MCI2_FE_MASK 0x800
#define MCCNTCON_CLR_TC1MCI2_FE 0x800
#define MCCNTCON_CLR_TC1MCI2_FE_BIT 11
#define MCCNTCON_CLR_TC2MCI0_RE_MASK 0x1000
#define MCCNTCON_CLR_TC2MCI0_RE 0x1000
#define MCCNTCON_CLR_TC2MCI0_RE_BIT 12
#define MCCNTCON_CLR_TC2MCI0_FE_MASK 0x2000
#define MCCNTCON_CLR_TC2MCI0_FE 0x2000
#define MCCNTCON_CLR_TC2MCI0_FE_BIT 13
#define MCCNTCON_CLR_TC2MCI1_RE_MASK 0x4000
#define MCCNTCON_CLR_TC2MCI1_RE 0x4000
#define MCCNTCON_CLR_TC2MCI1_RE_BIT 14
#define MCCNTCON_CLR_TC2MCI1_FE_MASK 0x8000
#define MCCNTCON_CLR_TC2MCI1_FE 0x8000
#define MCCNTCON_CLR_TC2MCI1_FE_BIT 15
#define MCCNTCON_CLR_TC2MCI2_RE_MASK 0x10000
#define MCCNTCON_CLR_TC2MCI2_RE 0x10000
#define MCCNTCON_CLR_TC2MCI2_RE_BIT 16
#define MCCNTCON_CLR_TC2MCI2_FE_MASK 0x20000
#define MCCNTCON_CLR_TC2MCI2_FE 0x20000
#define MCCNTCON_CLR_TC2MCI2_FE_BIT 17
#define MCCNTCON_CLR_CNTR0_MASK 0x20000000
#define MCCNTCON_CLR_CNTR0 0x20000000
#define MCCNTCON_CLR_CNTR0_BIT 29
#define MCCNTCON_CLR_CNTR1_MASK 0x40000000
#define MCCNTCON_CLR_CNTR1 0x40000000
#define MCCNTCON_CLR_CNTR1_BIT 30
#define MCCNTCON_CLR_CNTR2_MASK 0x80000000
#define MCCNTCON_CLR_CNTR2 0x80000000
#define MCCNTCON_CLR_CNTR2_BIT 31

#define MCINTF (*(volatile unsigned long *)0x400B8068)
#define MCINTF_OFFSET 0x68
#define MCINTF_ILIM0_MASK 0x1
#define MCINTF_ILIM0 0x1
#define MCINTF_ILIM0_BIT 0
#define MCINTF_IMAT0_MASK 0x2
#define MCINTF_IMAT0 0x2
#define MCINTF_IMAT0_BIT 1
#define MCINTF_ICAP0_MASK 0x4
#define MCINTF_ICAP0 0x4
#define MCINTF_ICAP0_BIT 2
#define MCINTF_ILIM1_MASK 0x10
#define MCINTF_ILIM1 0x10
#define MCINTF_ILIM1_BIT 4
#define MCINTF_IMAT1_MASK 0x20
#define MCINTF_IMAT1 0x20
#define MCINTF_IMAT1_BIT 5
#define MCINTF_ICAP1_MASK 0x40
#define MCINTF_ICAP1 0x40
#define MCINTF_ICAP1_BIT 6
#define MCINTF_ILIM2_MASK 0x100
#define MCINTF_ILIM2 0x100
#define MCINTF_ILIM2_BIT 8
#define MCINTF_IMAT2_MASK 0x200
#define MCINTF_IMAT2 0x200
#define MCINTF_IMAT2_BIT 9
#define MCINTF_ICAP2_MASK 0x400
#define MCINTF_ICAP2 0x400
#define MCINTF_ICAP2_BIT 10
#define MCINTF_ABORT_MASK 0x8000
#define MCINTF_ABORT 0x8000
#define MCINTF_ABORT_BIT 15

#define MCINTF_SET (*(volatile unsigned long *)0x400B806C)
#define MCINTF_SET_OFFSET 0x6C
#define MCINTF_SET_ILIM0_MASK 0x1
#define MCINTF_SET_ILIM0 0x1
#define MCINTF_SET_ILIM0_BIT 0
#define MCINTF_SET_IMAT0_MASK 0x2
#define MCINTF_SET_IMAT0 0x2
#define MCINTF_SET_IMAT0_BIT 1
#define MCINTF_SET_ICAP0_MASK 0x4
#define MCINTF_SET_ICAP0 0x4
#define MCINTF_SET_ICAP0_BIT 2
#define MCINTF_SET_ILIM1_MASK 0x10
#define MCINTF_SET_ILIM1 0x10
#define MCINTF_SET_ILIM1_BIT 4
#define MCINTF_SET_IMAT1_MASK 0x20
#define MCINTF_SET_IMAT1 0x20
#define MCINTF_SET_IMAT1_BIT 5
#define MCINTF_SET_ICAP1_MASK 0x40
#define MCINTF_SET_ICAP1 0x40
#define MCINTF_SET_ICAP1_BIT 6
#define MCINTF_SET_ILIM2_MASK 0x100
#define MCINTF_SET_ILIM2 0x100
#define MCINTF_SET_ILIM2_BIT 8
#define MCINTF_SET_IMAT2_MASK 0x200
#define MCINTF_SET_IMAT2 0x200
#define MCINTF_SET_IMAT2_BIT 9
#define MCINTF_SET_ICAP2_MASK 0x400
#define MCINTF_SET_ICAP2 0x400
#define MCINTF_SET_ICAP2_BIT 10
#define MCINTF_SET_ABORT_MASK 0x8000
#define MCINTF_SET_ABORT 0x8000
#define MCINTF_SET_ABORT_BIT 15

#define MCINTF_CLR (*(volatile unsigned long *)0x400B8070)
#define MCINTF_CLR_OFFSET 0x70
#define MCINTF_CLR_ILIM0_MASK 0x1
#define MCINTF_CLR_ILIM0 0x1
#define MCINTF_CLR_ILIM0_BIT 0
#define MCINTF_CLR_IMAT0_MASK 0x2
#define MCINTF_CLR_IMAT0 0x2
#define MCINTF_CLR_IMAT0_BIT 1
#define MCINTF_CLR_ICAP0_MASK 0x4
#define MCINTF_CLR_ICAP0 0x4
#define MCINTF_CLR_ICAP0_BIT 2
#define MCINTF_CLR_ILIM1_MASK 0x10
#define MCINTF_CLR_ILIM1 0x10
#define MCINTF_CLR_ILIM1_BIT 4
#define MCINTF_CLR_IMAT1_MASK 0x20
#define MCINTF_CLR_IMAT1 0x20
#define MCINTF_CLR_IMAT1_BIT 5
#define MCINTF_CLR_ICAP1_MASK 0x40
#define MCINTF_CLR_ICAP1 0x40
#define MCINTF_CLR_ICAP1_BIT 6
#define MCINTF_CLR_ILIM2_MASK 0x100
#define MCINTF_CLR_ILIM2 0x100
#define MCINTF_CLR_ILIM2_BIT 8
#define MCINTF_CLR_IMAT2_MASK 0x200
#define MCINTF_CLR_IMAT2 0x200
#define MCINTF_CLR_IMAT2_BIT 9
#define MCINTF_CLR_ICAP2_MASK 0x400
#define MCINTF_CLR_ICAP2 0x400
#define MCINTF_CLR_ICAP2_BIT 10
#define MCINTF_CLR_ABORT_MASK 0x8000
#define MCINTF_CLR_ABORT 0x8000
#define MCINTF_CLR_ABORT_BIT 15

#define MCCAP_CLR (*(volatile unsigned long *)0x400B8074)
#define MCCAP_CLR_OFFSET 0x74
#define MCCAP_CLR_CAP_CLR0_MASK 0x1
#define MCCAP_CLR_CAP_CLR0 0x1
#define MCCAP_CLR_CAP_CLR0_BIT 0
#define MCCAP_CLR_CAP_CLR1_MASK 0x2
#define MCCAP_CLR_CAP_CLR1 0x2
#define MCCAP_CLR_CAP_CLR1_BIT 1
#define MCCAP_CLR_CAP_CLR2_MASK 0x4
#define MCCAP_CLR_CAP_CLR2 0x4
#define MCCAP_CLR_CAP_CLR2_BIT 2

#define QEI_BASE_ADDRESS 0x400BC000

#define QEICON (*(volatile unsigned long *)0x400BC000)
#define QEICON_OFFSET 0x0
#define QEICON_RESP_MASK 0x1
#define QEICON_RESP 0x1
#define QEICON_RESP_BIT 0
#define QEICON_RESPI_MASK 0x2
#define QEICON_RESPI 0x2
#define QEICON_RESPI_BIT 1
#define QEICON_RESV_MASK 0x4
#define QEICON_RESV 0x4
#define QEICON_RESV_BIT 2
#define QEICON_RESi_MASK 0x8
#define QEICON_RESi 0x8
#define QEICON_RESi_BIT 3

#define QEISTAT (*(volatile unsigned long *)0x400BC004)
#define QEISTAT_OFFSET 0x4
#define QEISTAT_DIR_MASK 0x1
#define QEISTAT_DIR 0x1
#define QEISTAT_DIR_BIT 0

