FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1768/CodeRed2/include/LPC1756.h
#define I2C_CLKLO (*(volatile unsigned *)0x5000C310)
#define I2C_CLKLO_OFFSET 0x310
#define I2C_CLKLO_CDLO_MASK 0xFF
#define I2C_CLKLO_CDLO_BIT 0

#define USBClkCtrl (*(volatile unsigned *)0x5000CFF4)
#define USBClkCtrl_OFFSET 0xFF4
#define USBClkCtrl_DEV_CLK_EN_MASK 0x2
#define USBClkCtrl_DEV_CLK_EN 0x2
#define USBClkCtrl_DEV_CLK_EN_BIT 1
#define USBClkCtrl_PORTSEL_CLK_EN_MASK 0x8
#define USBClkCtrl_PORTSEL_CLK_EN 0x8
#define USBClkCtrl_PORTSEL_CLK_EN_BIT 3
#define USBClkCtrl_AHB_CLK_EN_MASK 0x10
#define USBClkCtrl_AHB_CLK_EN 0x10
#define USBClkCtrl_AHB_CLK_EN_BIT 4

#define USBClkSt (*(volatile unsigned *)0x5000CFF8)
#define USBClkSt_OFFSET 0xFF8
#define USBClkSt_DEV_CLK_ON_MASK 0x2
#define USBClkSt_DEV_CLK_ON 0x2
#define USBClkSt_DEV_CLK_ON_BIT 1
#define USBClkSt_PORTSEL_CLK_ON_MASK 0x8
#define USBClkSt_PORTSEL_CLK_ON 0x8
#define USBClkSt_PORTSEL_CLK_ON_BIT 3
#define USBClkSt_AHB_CLK_ON_MASK 0x10
#define USBClkSt_AHB_CLK_ON 0x10
#define USBClkSt_AHB_CLK_ON_BIT 4

#define OTGClkCtrl (*(volatile unsigned *)0x5000CFF4)
#define OTGClkCtrl_OFFSET 0xFF4
#define OTGClkCtrl_HOST_CLK_EN_MASK 0x1
#define OTGClkCtrl_HOST_CLK_EN 0x1
#define OTGClkCtrl_HOST_CLK_EN_BIT 0
#define OTGClkCtrl_DEV_CLK_EN_MASK 0x2
#define OTGClkCtrl_DEV_CLK_EN 0x2
#define OTGClkCtrl_DEV_CLK_EN_BIT 1
#define OTGClkCtrl_I2C_CLK_EN_MASK 0x4
#define OTGClkCtrl_I2C_CLK_EN 0x4
#define OTGClkCtrl_I2C_CLK_EN_BIT 2
#define OTGClkCtrl_OTG_CLK_EN_MASK 0x8
#define OTGClkCtrl_OTG_CLK_EN 0x8
#define OTGClkCtrl_OTG_CLK_EN_BIT 3
#define OTGClkCtrl_AHB_CLK_EN_MASK 0x10
#define OTGClkCtrl_AHB_CLK_EN 0x10
#define OTGClkCtrl_AHB_CLK_EN_BIT 4

#define OTGClkSt (*(volatile unsigned *)0x5000CFF8)
#define OTGClkSt_OFFSET 0xFF8
#define OTGClkSt_HOST_CLK_ON_MASK 0x1
#define OTGClkSt_HOST_CLK_ON 0x1
#define OTGClkSt_HOST_CLK_ON_BIT 0
#define OTGClkSt_DEV_CLK_ON_MASK 0x2
#define OTGClkSt_DEV_CLK_ON 0x2
#define OTGClkSt_DEV_CLK_ON_BIT 1
#define OTGClkSt_I2C_CLK_ON_MASK 0x4
#define OTGClkSt_I2C_CLK_ON 0x4
#define OTGClkSt_I2C_CLK_ON_BIT 2
#define OTGClkSt_OTG_CLK_ON_MASK 0x8
#define OTGClkSt_OTG_CLK_ON 0x8
#define OTGClkSt_OTG_CLK_ON_BIT 3
#define OTGClkSt_AHB_CLK_ON_MASK 0x10
#define OTGClkSt_AHB_CLK_ON 0x10
#define OTGClkSt_AHB_CLK_ON_BIT 4

#define USB_HOST_BASE_ADDRESS 0x5000C000

#define HcRevision (*(volatile unsigned *)0x5000C000)
#define HcRevision_OFFSET 0x0
#define HcRevision_REV_MASK 0xFF
#define HcRevision_REV_BIT 0

#define HcControl (*(volatile unsigned *)0x5000C004)
#define HcControl_OFFSET 0x4
#define HcControl_CBSR_MASK 0x3
#define HcControl_CBSR_BIT 0
#define HcControl_PLE_MASK 0x4
#define HcControl_PLE 0x4
#define HcControl_PLE_BIT 2
#define HcControl_IE_MASK 0x8
#define HcControl_IE 0x8
#define HcControl_IE_BIT 3
#define HcControl_CLE_MASK 0x10
#define HcControl_CLE 0x10
#define HcControl_CLE_BIT 4
#define HcControl_BLE_MASK 0x20
#define HcControl_BLE 0x20
#define HcControl_BLE_BIT 5
#define HcControl_HCFS_MASK 0xC0
#define HcControl_HCFS_BIT 6
#define HcControl_IR_MASK 0x100
#define HcControl_IR 0x100
#define HcControl_IR_BIT 8
#define HcControl_RWC_MASK 0x200
#define HcControl_RWC 0x200
#define HcControl_RWC_BIT 9
#define HcControl_RWE_MASK 0x400
#define HcControl_RWE 0x400
#define HcControl_RWE_BIT 10

#define HcCommandStatus (*(volatile unsigned *)0x5000C008)
#define HcCommandStatus_OFFSET 0x8
#define HcCommandStatus_HCR_MASK 0x1
#define HcCommandStatus_HCR 0x1
#define HcCommandStatus_HCR_BIT 0
#define HcCommandStatus_CLF_MASK 0x2
#define HcCommandStatus_CLF 0x2
#define HcCommandStatus_CLF_BIT 1
#define HcCommandStatus_BLF_MASK 0x4
#define HcCommandStatus_BLF 0x4
#define HcCommandStatus_BLF_BIT 2
#define HcCommandStatus_OCR_MASK 0x8
#define HcCommandStatus_OCR 0x8
#define HcCommandStatus_OCR_BIT 3
#define HcCommandStatus_SOC_MASK 0xC0
#define HcCommandStatus_SOC_BIT 6

#define HcInterruptStatus (*(volatile unsigned *)0x5000C00C)
#define HcInterruptStatus_OFFSET 0xC
#define HcInterruptStatus_SO_MASK 0x1
#define HcInterruptStatus_SO 0x1
#define HcInterruptStatus_SO_BIT 0
#define HcInterruptStatus_WDH_MASK 0x2
#define HcInterruptStatus_WDH 0x2
#define HcInterruptStatus_WDH_BIT 1
#define HcInterruptStatus_SF_MASK 0x4
#define HcInterruptStatus_SF 0x4
#define HcInterruptStatus_SF_BIT 2
#define HcInterruptStatus_RD_MASK 0x8
#define HcInterruptStatus_RD 0x8
#define HcInterruptStatus_RD_BIT 3
#define HcInterruptStatus_UE_MASK 0x10
#define HcInterruptStatus_UE 0x10
#define HcInterruptStatus_UE_BIT 4
#define HcInterruptStatus_FNO_MASK 0x20
#define HcInterruptStatus_FNO 0x20
#define HcInterruptStatus_FNO_BIT 5
#define HcInterruptStatus_RHSC_MASK 0x40
#define HcInterruptStatus_RHSC 0x40
#define HcInterruptStatus_RHSC_BIT 6
#define HcInterruptStatus_OC_MASK 0x40000000
#define HcInterruptStatus_OC 0x40000000
#define HcInterruptStatus_OC_BIT 30

#define HcInterruptEnable (*(volatile unsigned *)0x5000C010)
#define HcInterruptEnable_OFFSET 0x10
#define HcInterruptEnable_SO_MASK 0x1
#define HcInterruptEnable_SO 0x1
#define HcInterruptEnable_SO_BIT 0
#define HcInterruptEnable_WDH_MASK 0x2
#define HcInterruptEnable_WDH 0x2
#define HcInterruptEnable_WDH_BIT 1
#define HcInterruptEnable_SF_MASK 0x4
#define HcInterruptEnable_SF 0x4
#define HcInterruptEnable_SF_BIT 2
#define HcInterruptEnable_RD_MASK 0x8
#define HcInterruptEnable_RD 0x8
#define HcInterruptEnable_RD_BIT 3
#define HcInterruptEnable_UE_MASK 0x10
#define HcInterruptEnable_UE 0x10
#define HcInterruptEnable_UE_BIT 4
#define HcInterruptEnable_FNO_MASK 0x20
#define HcInterruptEnable_FNO 0x20
#define HcInterruptEnable_FNO_BIT 5
#define HcInterruptEnable_RHSC_MASK 0x40
#define HcInterruptEnable_RHSC 0x40
#define HcInterruptEnable_RHSC_BIT 6
#define HcInterruptEnable_OC_MASK 0x40000000
#define HcInterruptEnable_OC 0x40000000
#define HcInterruptEnable_OC_BIT 30
#define HcInterruptEnable_MIE_MASK 0x80000000
#define HcInterruptEnable_MIE 0x80000000
#define HcInterruptEnable_MIE_BIT 31

