FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1768/CodeRed2/include/LPC1756.h
#define InterruptType_BASE_ADDRESS 0xE000E000

#define InterruptType_ICTR (*(volatile unsigned *)0xE000E004)
#define Interrupt_Control_Type InterruptType_ICTR
#define InterruptType_ICTR_OFFSET 0x4
#define Interrupt_Control_Type_OFFSET InterruptType_ICTR_OFFSET
#define InterruptType_ICTR_INTLINESNUM_MASK 0x1F
#define Interrupt_Control_Type_INTLINESNUM_MASK InterruptType_ICTR_INTLINESNUM_MASK
#define InterruptType_ICTR_INTLINESNUM_BIT 0
#define Interrupt_Control_Type_INTLINESNUM_BIT InterruptType_ICTR_INTLINESNUM_BIT

#define SysTick_BASE_ADDRESS 0xE000E010

#define SysTick_CTRL (*(volatile unsigned *)0xE000E010)
#define SysTick_Control_And_Status SysTick_CTRL
#define SysTick_CTRL_OFFSET 0x0
#define SysTick_Control_And_Status_OFFSET SysTick_CTRL_OFFSET
#define SysTick_CTRL_COUNTFLAG_MASK 0x10000
#define SysTick_Control_And_Status_COUNTFLAG_MASK SysTick_CTRL_COUNTFLAG_MASK
#define SysTick_CTRL_COUNTFLAG 0x10000
#define SysTick_Control_And_Status_COUNTFLAG SysTick_CTRL_COUNTFLAG
#define SysTick_CTRL_COUNTFLAG_BIT 16
#define SysTick_Control_And_Status_COUNTFLAG_BIT SysTick_CTRL_COUNTFLAG_BIT
#define SysTick_CTRL_CLKSOURCE_MASK 0x4
#define SysTick_Control_And_Status_CLKSOURCE_MASK SysTick_CTRL_CLKSOURCE_MASK
#define SysTick_CTRL_CLKSOURCE 0x4
#define SysTick_Control_And_Status_CLKSOURCE SysTick_CTRL_CLKSOURCE
#define SysTick_CTRL_CLKSOURCE_BIT 2
#define SysTick_Control_And_Status_CLKSOURCE_BIT SysTick_CTRL_CLKSOURCE_BIT
#define SysTick_CTRL_TICKINT_MASK 0x2
#define SysTick_Control_And_Status_TICKINT_MASK SysTick_CTRL_TICKINT_MASK
#define SysTick_CTRL_TICKINT 0x2
#define SysTick_Control_And_Status_TICKINT SysTick_CTRL_TICKINT
#define SysTick_CTRL_TICKINT_BIT 1
#define SysTick_Control_And_Status_TICKINT_BIT SysTick_CTRL_TICKINT_BIT
#define SysTick_CTRL_ENABLE_MASK 0x1
#define SysTick_Control_And_Status_ENABLE_MASK SysTick_CTRL_ENABLE_MASK
#define SysTick_CTRL_ENABLE 0x1
#define SysTick_Control_And_Status_ENABLE SysTick_CTRL_ENABLE
#define SysTick_CTRL_ENABLE_BIT 0
#define SysTick_Control_And_Status_ENABLE_BIT SysTick_CTRL_ENABLE_BIT

#define SysTick_LOAD (*(volatile unsigned *)0xE000E014)
#define SysTick_Reload_Value SysTick_LOAD
#define SysTick_LOAD_OFFSET 0x4
#define SysTick_Reload_Value_OFFSET SysTick_LOAD_OFFSET
#define SysTick_LOAD_RELOAD_MASK 0xFFFFFF
#define SysTick_Reload_Value_RELOAD_MASK SysTick_LOAD_RELOAD_MASK
#define SysTick_LOAD_RELOAD_BIT 0
#define SysTick_Reload_Value_RELOAD_BIT SysTick_LOAD_RELOAD_BIT

#define SysTick_VAL (*(volatile unsigned *)0xE000E018)
#define SysTick_Current_Value SysTick_VAL
#define SysTick_VAL_OFFSET 0x8
#define SysTick_Current_Value_OFFSET SysTick_VAL_OFFSET
#define SysTick_VAL_CURRENT_MASK 0xFFFFFF
#define SysTick_Current_Value_CURRENT_MASK SysTick_VAL_CURRENT_MASK
#define SysTick_VAL_CURRENT_BIT 0
#define SysTick_Current_Value_CURRENT_BIT SysTick_VAL_CURRENT_BIT

#define SysTick_CALIB (*(volatile unsigned *)0xE000E01C)
#define SysTick_Calibration_Value SysTick_CALIB
#define SysTick_CALIB_OFFSET 0xC
#define SysTick_Calibration_Value_OFFSET SysTick_CALIB_OFFSET
#define SysTick_CALIB_NOREF_MASK 0x80000000
#define SysTick_Calibration_Value_NOREF_MASK SysTick_CALIB_NOREF_MASK
#define SysTick_CALIB_NOREF 0x80000000
#define SysTick_Calibration_Value_NOREF SysTick_CALIB_NOREF
#define SysTick_CALIB_NOREF_BIT 31
#define SysTick_Calibration_Value_NOREF_BIT SysTick_CALIB_NOREF_BIT
#define SysTick_CALIB_SKEW_MASK 0x40000000
#define SysTick_Calibration_Value_SKEW_MASK SysTick_CALIB_SKEW_MASK
#define SysTick_CALIB_SKEW 0x40000000
#define SysTick_Calibration_Value_SKEW SysTick_CALIB_SKEW
#define SysTick_CALIB_SKEW_BIT 30
#define SysTick_Calibration_Value_SKEW_BIT SysTick_CALIB_SKEW_BIT
#define SysTick_CALIB_TENMS_MASK 0xFFFFFF
#define SysTick_Calibration_Value_TENMS_MASK SysTick_CALIB_TENMS_MASK
#define SysTick_CALIB_TENMS_BIT 0
#define SysTick_Calibration_Value_TENMS_BIT SysTick_CALIB_TENMS_BIT

#define NVIC_BASE_ADDRESS 0xE000E100

#define NVIC_ISER0 (*(volatile unsigned *)0xE000E100)
#define Irq_0_to_31_Set_Enable NVIC_ISER0
#define NVIC_ISER0_OFFSET 0x0
#define Irq_0_to_31_Set_Enable_OFFSET NVIC_ISER0_OFFSET

#define NVIC_ISER1 (*(volatile unsigned *)0xE000E104)
#define Irq_32_to_63_Set_Enable NVIC_ISER1
#define NVIC_ISER1_OFFSET 0x4
#define Irq_32_to_63_Set_Enable_OFFSET NVIC_ISER1_OFFSET

#define NVIC_ISER2 (*(volatile unsigned *)0xE000E108)
#define Irq_64_to_95_Set_Enable NVIC_ISER2
#define NVIC_ISER2_OFFSET 0x8
#define Irq_64_to_95_Set_Enable_OFFSET NVIC_ISER2_OFFSET

#define NVIC_ISER3 (*(volatile unsigned *)0xE000E10C)
#define Irq_96_to_127_Set_Enable NVIC_ISER3
#define NVIC_ISER3_OFFSET 0xC
#define Irq_96_to_127_Set_Enable_OFFSET NVIC_ISER3_OFFSET

#define NVIC_ICER0 (*(volatile unsigned *)0xE000E180)
#define Irq_0_to_31_Clear_Enable NVIC_ICER0
#define NVIC_ICER0_OFFSET 0x80
#define Irq_0_to_31_Clear_Enable_OFFSET NVIC_ICER0_OFFSET

#define NVIC_ICER1 (*(volatile unsigned *)0xE000E184)
#define Irq_32_to_63_Clear_Enable NVIC_ICER1
#define NVIC_ICER1_OFFSET 0x84
#define Irq_32_to_63_Clear_Enable_OFFSET NVIC_ICER1_OFFSET

#define NVIC_ICER2 (*(volatile unsigned *)0xE000E188)
#define Irq_64_to_95_Clear_Enable NVIC_ICER2
#define NVIC_ICER2_OFFSET 0x88
#define Irq_64_to_95_Clear_Enable_OFFSET NVIC_ICER2_OFFSET

#define NVIC_ICER3 (*(volatile unsigned *)0xE000E18C)
#define Irq_96_to_127_Clear_Enable NVIC_ICER3
#define NVIC_ICER3_OFFSET 0x8C
#define Irq_96_to_127_Clear_Enable_OFFSET NVIC_ICER3_OFFSET

#define NVIC_ISPR0 (*(volatile unsigned *)0xE000E200)
#define Irq_0_to_31_Set_Pending NVIC_ISPR0
#define NVIC_ISPR0_OFFSET 0x100
#define Irq_0_to_31_Set_Pending_OFFSET NVIC_ISPR0_OFFSET

#define NVIC_ISPR1 (*(volatile unsigned *)0xE000E204)
#define Irq_32_to_63_Set_Pending NVIC_ISPR1
#define NVIC_ISPR1_OFFSET 0x104
#define Irq_32_to_63_Set_Pending_OFFSET NVIC_ISPR1_OFFSET

#define NVIC_ISPR2 (*(volatile unsigned *)0xE000E208)
#define Irq_64_to_95_Set_Pending NVIC_ISPR2
#define NVIC_ISPR2_OFFSET 0x108
#define Irq_64_to_95_Set_Pending_OFFSET NVIC_ISPR2_OFFSET

#define NVIC_ISPR3 (*(volatile unsigned *)0xE000E20C)
#define Irq_96_to_127_Set_Pending NVIC_ISPR3
#define NVIC_ISPR3_OFFSET 0x10C
#define Irq_96_to_127_Set_Pending_OFFSET NVIC_ISPR3_OFFSET

