FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1768/CodeRed2/include/LPC1756.h
#define NVIC_IP2 (*(volatile unsigned char *)0xE000E402)
#define NVIC_IP2_OFFSET 0x302

#define NVIC_IP3 (*(volatile unsigned char *)0xE000E403)
#define NVIC_IP3_OFFSET 0x303

#define NVIC_IP4 (*(volatile unsigned char *)0xE000E404)
#define NVIC_IP4_OFFSET 0x304

#define NVIC_IP5 (*(volatile unsigned char *)0xE000E405)
#define NVIC_IP5_OFFSET 0x305

#define NVIC_IP6 (*(volatile unsigned char *)0xE000E406)
#define NVIC_IP6_OFFSET 0x306

#define NVIC_IP7 (*(volatile unsigned char *)0xE000E407)
#define NVIC_IP7_OFFSET 0x307

#define NVIC_IP8 (*(volatile unsigned char *)0xE000E408)
#define NVIC_IP8_OFFSET 0x308

#define NVIC_IP9 (*(volatile unsigned char *)0xE000E409)
#define NVIC_IP9_OFFSET 0x309

#define NVIC_IP10 (*(volatile unsigned char *)0xE000E40A)
#define NVIC_IP10_OFFSET 0x30A

#define NVIC_IP11 (*(volatile unsigned char *)0xE000E40B)
#define NVIC_IP11_OFFSET 0x30B

#define NVIC_IP12 (*(volatile unsigned char *)0xE000E40C)
#define NVIC_IP12_OFFSET 0x30C

#define NVIC_IP13 (*(volatile unsigned char *)0xE000E40D)
#define NVIC_IP13_OFFSET 0x30D

#define NVIC_IP14 (*(volatile unsigned char *)0xE000E40E)
#define NVIC_IP14_OFFSET 0x30E

#define NVIC_IP15 (*(volatile unsigned char *)0xE000E40F)
#define NVIC_IP15_OFFSET 0x30F

#define NVIC_IP16 (*(volatile unsigned char *)0xE000E410)
#define NVIC_IP16_OFFSET 0x310

#define NVIC_IP17 (*(volatile unsigned char *)0xE000E411)
#define NVIC_IP17_OFFSET 0x311

#define NVIC_IP18 (*(volatile unsigned char *)0xE000E412)
#define NVIC_IP18_OFFSET 0x312

#define NVIC_IP19 (*(volatile unsigned char *)0xE000E413)
#define NVIC_IP19_OFFSET 0x313

#define NVIC_IP20 (*(volatile unsigned char *)0xE000E414)
#define NVIC_IP20_OFFSET 0x314

#define NVIC_IP21 (*(volatile unsigned char *)0xE000E415)
#define NVIC_IP21_OFFSET 0x315

#define NVIC_IP22 (*(volatile unsigned char *)0xE000E416)
#define NVIC_IP22_OFFSET 0x316

#define NVIC_IP23 (*(volatile unsigned char *)0xE000E417)
#define NVIC_IP23_OFFSET 0x317

#define NVIC_IP24 (*(volatile unsigned char *)0xE000E418)
#define NVIC_IP24_OFFSET 0x318

#define NVIC_IP25 (*(volatile unsigned char *)0xE000E419)
#define NVIC_IP25_OFFSET 0x319

#define NVIC_IP26 (*(volatile unsigned char *)0xE000E41A)
#define NVIC_IP26_OFFSET 0x31A

#define NVIC_IP27 (*(volatile unsigned char *)0xE000E41B)
#define NVIC_IP27_OFFSET 0x31B

#define NVIC_IP28 (*(volatile unsigned char *)0xE000E41C)
#define NVIC_IP28_OFFSET 0x31C

#define NVIC_IP29 (*(volatile unsigned char *)0xE000E41D)
#define NVIC_IP29_OFFSET 0x31D

#define NVIC_IP30 (*(volatile unsigned char *)0xE000E41E)
#define NVIC_IP30_OFFSET 0x31E

#define NVIC_IP31 (*(volatile unsigned char *)0xE000E41F)
#define NVIC_IP31_OFFSET 0x31F

#define NVIC_IP32 (*(volatile unsigned char *)0xE000E420)
#define NVIC_IP32_OFFSET 0x320

#define NVIC_IP33 (*(volatile unsigned char *)0xE000E421)
#define NVIC_IP33_OFFSET 0x321

#define NVIC_IP34 (*(volatile unsigned char *)0xE000E422)
#define NVIC_IP34_OFFSET 0x322

#define NVIC_IP35 (*(volatile unsigned char *)0xE000E423)
#define NVIC_IP35_OFFSET 0x323

#define NVIC_IP36 (*(volatile unsigned char *)0xE000E424)
#define NVIC_IP36_OFFSET 0x324

#define NVIC_IP37 (*(volatile unsigned char *)0xE000E425)
#define NVIC_IP37_OFFSET 0x325

#define NVIC_IP38 (*(volatile unsigned char *)0xE000E426)
#define NVIC_IP38_OFFSET 0x326

#define NVIC_IP39 (*(volatile unsigned char *)0xE000E427)
#define NVIC_IP39_OFFSET 0x327

#define NVIC_IP40 (*(volatile unsigned char *)0xE000E428)
#define NVIC_IP40_OFFSET 0x328

#define NVIC_IP41 (*(volatile unsigned char *)0xE000E429)
#define NVIC_IP41_OFFSET 0x329

#define NVIC_IP42 (*(volatile unsigned char *)0xE000E42A)
#define NVIC_IP42_OFFSET 0x32A

#define NVIC_IP43 (*(volatile unsigned char *)0xE000E42B)
#define NVIC_IP43_OFFSET 0x32B

#define NVIC_IP44 (*(volatile unsigned char *)0xE000E42C)
#define NVIC_IP44_OFFSET 0x32C

#define NVIC_IP45 (*(volatile unsigned char *)0xE000E42D)
#define NVIC_IP45_OFFSET 0x32D

#define NVIC_IP46 (*(volatile unsigned char *)0xE000E42E)
#define NVIC_IP46_OFFSET 0x32E

#define NVIC_IP47 (*(volatile unsigned char *)0xE000E42F)
#define NVIC_IP47_OFFSET 0x32F

#define NVIC_IP48 (*(volatile unsigned char *)0xE000E430)
#define NVIC_IP48_OFFSET 0x330

#define NVIC_IP49 (*(volatile unsigned char *)0xE000E431)
#define NVIC_IP49_OFFSET 0x331

#define NVIC_IP50 (*(volatile unsigned char *)0xE000E432)
#define NVIC_IP50_OFFSET 0x332

#define NVIC_IP51 (*(volatile unsigned char *)0xE000E433)
#define NVIC_IP51_OFFSET 0x333

#define NVIC_IP52 (*(volatile unsigned char *)0xE000E434)
#define NVIC_IP52_OFFSET 0x334

#define NVIC_IP53 (*(volatile unsigned char *)0xE000E435)
#define NVIC_IP53_OFFSET 0x335

#define NVIC_IP54 (*(volatile unsigned char *)0xE000E436)
#define NVIC_IP54_OFFSET 0x336

#define NVIC_IP55 (*(volatile unsigned char *)0xE000E437)
#define NVIC_IP55_OFFSET 0x337

#define NVIC_IP56 (*(volatile unsigned char *)0xE000E438)
#define NVIC_IP56_OFFSET 0x338

#define NVIC_IP57 (*(volatile unsigned char *)0xE000E439)
#define NVIC_IP57_OFFSET 0x339

#define NVIC_IP58 (*(volatile unsigned char *)0xE000E43A)
#define NVIC_IP58_OFFSET 0x33A

#define NVIC_IP59 (*(volatile unsigned char *)0xE000E43B)
#define NVIC_IP59_OFFSET 0x33B

#define NVIC_IP60 (*(volatile unsigned char *)0xE000E43C)
#define NVIC_IP60_OFFSET 0x33C

#define NVIC_IP61 (*(volatile unsigned char *)0xE000E43D)
#define NVIC_IP61_OFFSET 0x33D

#define NVIC_IP62 (*(volatile unsigned char *)0xE000E43E)
#define NVIC_IP62_OFFSET 0x33E

#define NVIC_IP63 (*(volatile unsigned char *)0xE000E43F)
#define NVIC_IP63_OFFSET 0x33F

#define NVIC_IP64 (*(volatile unsigned char *)0xE000E440)
#define NVIC_IP64_OFFSET 0x340

#define NVIC_IP65 (*(volatile unsigned char *)0xE000E441)
#define NVIC_IP65_OFFSET 0x341

#define NVIC_IP66 (*(volatile unsigned char *)0xE000E442)
#define NVIC_IP66_OFFSET 0x342

#define NVIC_IP67 (*(volatile unsigned char *)0xE000E443)
#define NVIC_IP67_OFFSET 0x343

#define NVIC_IP68 (*(volatile unsigned char *)0xE000E444)
#define NVIC_IP68_OFFSET 0x344

#define NVIC_IP69 (*(volatile unsigned char *)0xE000E445)
#define NVIC_IP69_OFFSET 0x345

#define NVIC_IP70 (*(volatile unsigned char *)0xE000E446)
#define NVIC_IP70_OFFSET 0x346

#define NVIC_IP71 (*(volatile unsigned char *)0xE000E447)
#define NVIC_IP71_OFFSET 0x347

